import inspect
#print(inspect.isfunction()) -- позволяет понять, наш объект является фнкцией или нет
#print(inspect.isclass()) -- позволяет понять наш объект является классом или нет
#print(inspect.ismodule()) -- позволяет понять наш объект является модулем или нетz
#print(inspect.isframe()) -- позволяет понять объект является фрейм объектом или нет
#print(inspect.iscode()) -- позволяет понять объект является объектом кодом
#print(inspect.isbuiltin()) -- позволяет понять объект является встроенной функцией или нет
#print(inspect.isgenerator()) -- позволяет понять объект является генератором или нет